app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Harry Potdefleur"], ["created_at", "2018-03-08 18:47:10.913091"], ["updated_at", "2018-03-08 18:47:10.913091"]]

  def update
    @book = Book.find(params[:id])
    if @book.update((book_params))
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Cabbages and Kings 2"], ["updated_at", "2018-03-08 20:12:26.461040"], ["id", 5]]